# running in insn_add_ch0/src/
read_verilog -sv insn_add_ch0.sv
read_verilog -sv /home/lordegypt/KemetCore/third_party/riscv-formal/cores/sethcore/../../../../projects/sethcore/rtl/seth_pipeline_csr.sv
read_verilog -sv /home/lordegypt/KemetCore/third_party/riscv-formal/cores/sethcore/../../../../projects/sethcore/rtl/seth_decode.sv
read_verilog -sv /home/lordegypt/KemetCore/third_party/riscv-formal/cores/sethcore/../../../../projects/sethcore/rtl/seth_imm.sv
read_verilog -sv /home/lordegypt/KemetCore/third_party/riscv-formal/cores/sethcore/../../../../projects/sethcore/rtl/seth_aluctl.sv
read_verilog -sv /home/lordegypt/KemetCore/third_party/riscv-formal/cores/sethcore/../../../../projects/sethcore/rtl/seth_alu.sv
read_verilog -sv /home/lordegypt/KemetCore/third_party/riscv-formal/cores/sethcore/../../../../projects/sethcore/rtl/seth_muldiv.sv
read_verilog -sv /home/lordegypt/KemetCore/third_party/riscv-formal/cores/sethcore/../../../../projects/sethcore/rtl/seth_regfile.sv
read_verilog -sv /home/lordegypt/KemetCore/third_party/riscv-formal/cores/sethcore/../../../../projects/sethcore/rtl/seth_trap.sv
read_verilog -sv /home/lordegypt/KemetCore/third_party/riscv-formal/cores/sethcore/../../cores/sethcore/wrapper.sv
prep -flatten -nordff -top rvfi_testbench
chformal -early

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
